void printAms(int n)
{
    // Розкладаємо числа у степені 1
    if (n <= 10)
    //Перевіряемо умову якщо, умова вірна то виводимо наступний рядок
    {
        printf("%d = %d^1", n, n % 10);
    }
    // Розкладаємо числа у степені 3
    else if(n>=100 && n<=1000){
        //Перевіряемо умову якщо, умова вірна то виводимо наступний рядок
        printf("%d = %d^3", n, n % 10);
        while(n)
        // Вводимо цикл, кожну частину числа підносимо до степеню та виводимо
        {
          n /= 10;
        if (n) printf(" + %d^3", n % 10);  
        }
    }
    // Розкладаємо числа у степені 4
    else if(n>=1000 && n<=10000){
        //Перевіряемо умову якщо, умова вірна то виводимо наступний рядок
        printf("%d = %d^4", n, n % 10);
        while(n)
        // Вводимо цикл, кожну частину числа підносимо до степеню та виводимо
        {
          n /= 10;
        if (n) printf(" + %d^4", n % 10);  
        }
    }
    // Розкладаємо числа у степені 5
    else if(n>=10000 && n<=100000){
        //Перевіряемо умову якщо, умова вірна то виводимо наступний рядок
        printf("%d = %d^5", n, n % 10);
        while(n)
        // Вводимо цикл, кожну частину числа підносимо до степеню та виводимо
        {
          n /= 10;
        if (n) printf(" + %d^5", n % 10);  
        }
    }
    // Пропускаємо один рядок
    printf("\n");
}
